package com.example.zucchini;

public class collectionOfRecipes {
    public static final String name_1 = "Кабачки «Тещин язык»";
    public static final String description_1 = "Рецепт острой овощной закуски из кабачков «Тёщин язык» для домашнего консервирования.";
    public static final String recipe_1 = "Ингредиенты:\n" +
            "кабачки 3 кг" +
            "\n" +
            "помидоры 3 кг" +
            "\n" +
            "перец сладкий 5 шт" +
            "\n" +
            "чеснок 4 зубчика" +
            "\n" +
            "перец острый свежий 1-2 шт" +
            "\n" +
            "масло растительное 250 мл" +
            "\n" +
            "уксус 9% 100 мл" +
            "\n" +
            "сахар 6-8 ч. ложек" +
            "\n" +
            "соль 5-6 ч. ложек" +
            "\n" +
            "Как приготовить закуску из кабачков «Тёщин язык»:\n" +
            "Помидоры разрезать на несколько частей.\n" +
            "Сладкий перец нарезать, удалить семена.\n" +
            "Помидоры и перец пропустить через мясорубку. Перелить в кастрюлю.\n" +
            "Кабачки очистить, нарезать ломтиками в виде язычков.\n" +
            "Чеснок очистить и мелко нарезать. Острый перец очистить от семян и нарезать.\n" +
            "Измельченные помидоры и сладкий перец довести до кипения.\n" +
            "В кипящую томатную массу выложить «язычки» из кабачков. Добавить масло, соль, сахар и варить 30 минут.\n" +
            "Добавить нарезанный чеснок и острый перец, варить еще 5 минут. Добавить уксус (сразу весь не добавляйте, пробуйте закуску и регулируйте количество уксуса по своему вкусу), перемешать, довести до кипения, затем снять с огня.\n" +
            "Банки и крышки тщательно вымыть и простерилизовать.\n" +
            "Горячую овощную закуску разложить по сухим стерилизованным банкам и герметично закрыть.\n" +
            "Закуска «Тещин язык» из кабачков готова.\n" +
            "Приятного аппетита!";
    public static final String name_2 = "Кабачки закусочные";
    public static final String description_2 = "Маринованный салат из кабачков с морковью, луком, чесноком и зеленью. " +
            "Зимой, под рюмочку, - классные закусочные кабачки.";
    public static final String recipe_2 = "Ингредиенты:\n" +
            "кабачки 5 кг\n" +
            "морковь 300 г\n" +
            "лук 300 г\n" +
            "масло растительное 2 стакана\n" +
            "уксус 9% 1 стакан\n" +
            "сахар 1 стакан\n" +
            "соль 2 ст. ложки\n" +
            "чеснок 200 г\n" +
            "зелень (петрушка, укроп) 100 г\n" +
            "Кабачки вымыть, натереть на крупной терке или порезать на четвертинки кругов.\n" +
            "Морковь очистить, вымыть, натереть на крупной терке.\n" +
            "Лук очистить, вымыть, нарезать мелко.\n" +
            "Зелень вымыть, мелко нарезать.\n" +
            "Чеснок очистить, пропустить через пресс или мясорубку.\n" +
            "Смешать в большой кастрюле кабачки, морковь и лук. Добавить масло, сахар, соль и уксус. Варить 20 минут, помешивая.\n" +
            "Добавить в кастрюлю чеснок и зелень. Варить ещё 10 минут.\n" +
            "Банки промыть с содой. Простерилизовать любым способом.\n" +
            "Разложить в стерильные банки овощной салат, прикрыть прокипяченными крышками. Стерилизовать в кастрюле с водой 10 минут банки объемом 0,5 л.\n" +
            "Затем закатать.\n" +
            "Кабачки закусочные готовы.\n" +
            "Приятного аппетита!";
    public static final String name_3 = "Маринованные кабачки";
    public static final String description_3 = "Очень вкусный закусончик!";
    public static final String recipe_3 = "Ингредиенты:\n" +
            "На 700-граммовую банку:\n" +
            "кабачки молодой 400 г\n" +
            "лавровый лист 2 шт.\n" +
            "гвоздика 4-5 шт.\n" +
            "перец чёрный горошком 5-6 шт.\n" +
            "или перец белый горошком 5-6 шт.\n" +
            "Для маринада:\n" +
            "сахар 2 ст. ложки\n" +
            "соль 2 ч. ложки\n" +
            "уксус 9% 150 г\n" +
            "\n" +
            "1. Кабачки помыть, срезать плодоножку, нарезать их кружочками шириной в 1 см. Сложить в чистые сухие банки.\n" +
            "2. В каждую баночку положить по 2 лавровых листика, по 4-5 соцветий гвоздики и по 5-6 горошин белого или черного перца.\n" +
            "3. В кастрюльку налить 1 литр кипятка, поставить на огонь. Добавить туда 2 столовые ложки сахара, 2 чайные ложки соли, 150 г 9%-го уксуса, довести до кипения.\n" +
            "4. Залить маринад в баночки с кабачками, укупорить.\n" +
            "Если хотите их сохранить подольше - перед укупоркой пропастеризуйте баночки в кипящей воде примерно 1 час.\n" +
            "А вообще, они через два дня уже готовы к употреблению.\n" +
            "Приятного аппетита!";

    public static final String name_4 = "Кабачковая икра (на зиму)";
    public static final String description_4 = "Рецепт овощной икры из кабачков классический, но более упрощенный! Вкус кабачковой икры" +
            " – пальчики оближешь, понравится даже детям.";
    public static final String recipe_4 =
            "Ингредиенты:\n" +
            "кабачки 1.5 кг\n" +
            "морковь 250 г\n" +
            "лук репчатый 250 г\n" +
            "чеснок 3 зубчика\n" +
            "масло растительное 100 мл\n" +
            "томат-паста 150 г\n" +
            "соль 1 ст. ложка\n" +
            "сахар 4 ст. ложки\n" +
            "уксус 9% 50 мл\n" +
            "перец чёрный молотый по вкусу\n" +
            "Как приготовить кабачковую икру на зиму:\n" +
            "Овощи очищаем и режем произвольно на кусочки.\n" +
            "Пропускаем через мясорубку. Вливаем масло.\n" +
            "После закипания тушим 40 минут под крышкой.\n" +
            "Снимаем с плиты и пюрируем (по желанию). Добавляем томат, соль, сахар (количество можно регулировать). Тушим овощную икру под приоткрытой крышкой 20 минут, помешивая.\n" +
            "Добавляем в кабачковую икру измельченный чеснок и уксус, оставляем еще на 5 минут.\n" +
            "Раскладываем кабачковую икру на зиму по стерильным банкам, закрываем горячими крышками. Укутываем и даем остыть.\n" +
            "Кабачковая икра на зиму готова. Приятного аппетита!";

    public static final String name_5 = "Закуска из кабачков и моркови";
    public static final String description_5 = "По этому рецепту кабачки, морковь и лук " +
            "обжариваются раздельно, а затем консервируется.";
    public static final String recipe_5 = "Ингредиенты:\n" +
            "кабачки 700 г\n" +
            "морковь 300 г\n" +
            "лук 3 шт.\n" +
            "чеснок 4-6 зубчиков\n" +
            "зелень петрушки 1 пучок\n" +
            "зелень укропа 1 пучок\n" +
            "масло растительное 7 ст. ложек\n" +
            "уксус 3% 2 ст. ложки\n" +
            "сахар 1 ч. ложка\n" +
            "соль 0.75-1 ч. ложка\n" +
            "Подготовить продукты для закуски из кабачков и моркови.\n" +
            "Как приготовить закуску из кабачков и моркови:\n" +
            "Очистить кабачки, нарезать кубиками.\n" +
            "Нарезанные кабачки посолить.\n" +
            "На сковороде разогреть 2 ст. ложки растительного масла. Кабачки обжарить в растительном масле на среднем огне до золотистого цвета (7-9 минут).\n" +
            "Очистить и вымыть морковь, натереть на терке.\n" +
            "Лук очистить и мелко нарезать.\n" +
            "Лук и морковь посыпать сахаром\n" +
            "Лук и морковь обжарить отдельно в оставшемся растительном масле до мягкости (7-10 минут).\n" +
            "Чеснок нарубить.\n" +
            "Зелень петрушки и укропа вымыть, измельчить.\n" +
            "Кабачки, лук и морковь перемешать с чесноком и зеленью.\n" +
            "Смесь уложить в банки.\n" +
            "В каждую банку влить уксус.\n" +
            "Банки накрыть чистыми крышками и поставить в кастрюлю с горячей водой.\n" +
            "Стерилизовать полулитровые банки в течение 5 минут, литровые — в течение 7—10 минут.\n" +
            "Укупорить, охладить и убрать закуску из кабачков и моркови на хранение.";

}
